package Tsimbaliuk.HW11;
/*
Функциональный интерфейс
Function
Задание для самостоятельной проработки
1) С помощью реализации Function<Integer[],Integer> и реализации Predicate<Integer> (да нужно
вспоминать и предыдущую лекцию ☺) реализуйте функцию которая вернет количество простых
чисел в массиве целых чисел. Например [5,6,7,8,9,10] => 2
2) Опишите такую реализацию Function<String, Integer> которая вернет количество согласных букв в
строке текста.
3) Используя композицию функций реализуйте функцию которая вернет сумму кодов каждого
символа в произвольной строке.
4) Опишите такую реализацию BiFunction<String,String,String[]> которая вернет в виде массива
слова которые одновременно присутствуют и в первой строке и во второй (слова разделены
пробелами). Например text1 = «Hello Java», text2 = «Hello Python» в результате должен быть
массив вида [«Hello»].
5) Используя примитивную специализацию Function реализуйте функционал который на основе
объекта типа java.util.Calendar вернет целое число значение которого равно году хранимому в
Calendar.
 */
public class Main {
}
