package Tsimbaliuk.HW4;

/*
Потоки ввода вывода
1. Напишите программу которая скопирует файлы (с заранее
определенным разрешением — например только doc) из
каталога источника в каталог приемник.
2. Напишите программу которая примет на вход 2 текстовых
файла, а вернет один. Содержимым этого файла должны
быть слова которые есть и в первом и во втором файле.
3. Усовершенствуйте класс описывающий группу студентов
добавив возможность сохранения списка студентов в файл.
4. Реализовать обратный процесс — т.е. считать данные о
студентах из файла
 */
public class Main {
}
