package Tsimbaliuk.HW4;
<<<<<<< HEAD

/*
Потоки ввода вывода
1. Напишите программу которая скопирует файлы (с заранее
определенным разрешением — например только doc) из
каталога источника в каталог приемник.
2. Напишите программу которая примет на вход 2 текстовых
файла, а вернет один. Содержимым этого файла должны
быть слова которые есть и в первом и во втором файле.
3. Усовершенствуйте класс описывающий группу студентов
добавив возможность сохранения списка студентов в файл.
4. Реализовать обратный процесс — т.е. считать данные о
студентах из файла
=======
/*
1) Создайте сто потоков которые будут вычислять факториал
числа равного номеру этого потока и выводить результат на
экран.
2) Написать код для многопоточного подсчета суммы элементов
массива целых чисел. Сравнить скорость подсчета с простым
алгоритмом.
>>>>>>> f1469e4d1b5efbbe8343f08339e957399a5690d5
 */
public class Main {
}
