package Tsymbaliuk_Oleksandr_JavaOOP.HW18;
/*
Функциональный интерфейс
Supplier
Задание для самостоятельной проработки
1) Реализуйте с помощью класса Supplier<String> который будет при каждом вызове get()
возвращать слово полученное из строки переданной в качестве параметра конструктору этого
класса. Для упрощения задания выполните разбиение строки по символу пробел.
2) Реализуйте Supplier<String> с помощью Predicate<String> реализующий следующий функционал:
возвращать из List<String> только строки соответствующие реализации Predicate. Например если
у вас есть список [«Hello», «world», «Java»], а Predicate возвращает true только если слово
начинается с большой буквы, ваша реализация Supplier должна последовательно вернуть
«Hello», «Java» и после чего возвращать null (закончились подходящие значения).
3) Реализуйте IntSupplier последовательно возвращающий элемент из массива целых чисел.
 */
public class Main {
}
