package Tsimbaliuk.HW15;
/*
Функциональный интерфейс
UnaryOperator
Задание для самостоятельной проработки
1) С помощью реализации UnaryOperator замените все нечетные числа в списке целых
чисел на нули.
2) Создайте реализацию UnaryOperator<String> где результатом будет строка в которой
исключены все символы кроме цифровых. Т.е. если входящим параметром является
строка вида «Hello 123 world» результатом будет строка «123».
3) Создайте реализацию UnaryOperator<List<String>> где результатом будет список строк
(созданный на основе списка выступающего в качестве параметра) длинна которых
больше 5 символов.
 */
public class Main {
}
