package Tsimbaliuk.HW22;
/*
Stream API
Часть 4
Промежуточные методы для
изменения порядка потока
Задание для самостоятельной проработки
1) Разбейте строку английского текста по символу пробел. Полученный набор слов отсортируйте в
порядке возрастания количества гласных букв в нем. Слова в которых нет гласных букв стоит
исключить из результата.
2) Из массива студентов (да тех самых из основного в д.з) выберите студентов старше 20 лет, и
отсортируйте их по фамилии. Результат поместите в список.
3) Из списка целых чисел, выделите те значения которых больше 10, отсортируйте по значению
последней цифры результат выведите на экран

 */
public class Main {
}
