package Tsimbaliuk.HW7;

/*
Класс ObjectФайл
1. Создайте класс описывающий человека (создайте метод
выводящий информацию о человеке)
2. На его основе создайте класс студент (переопределите
метод вывода информации)
3. Создайте класс группа — который содержит массив из
объектов класса студент. Реализуйте метод поиска студента
по фамилии.
4. Используя стандартный методы сериализации создайте
мини базу данных для работы с группами студентов
(возможность записи и чтения базы из файла по запросу
пользователя).
 */

public class Main {
}
