package Tsimbaliuk.HW9;
/*

1)Проведите рефакторинг класса Группа. Замените массив студентов, на одну из
реализаций списка (например ArrayList) при этом должна сохраниться вся
функциональность. OK
Продвинутый уровень.
1)Проведите рефакторинг класса Стек (продвинутое задание прошлой лекции) путем
применения параметров типа для более полного контроля.OK
2)Добавьте возможность прохода по элементам стека с помощью цикла for-each. Для этого
класс стек должен реализовать интерфейс Iterable (тут нужно полистать документацию).OK
 */
public class GenericsAndCollections {
    public static void main(String[] args) {

    }
}
