package JavaStart.HW8;

/*
Дополнительное задание для самостоятельной проработки
1) Считайте из текстового файла текст на английском языке и выведите статистику по частоте
использования букв в тексте (т. е. буква — количество использования), причем первыми должны
выводиться буквы используемые чаще всего.
2) Напишите метод для создания в файле ASCII — арта, т. е. фигуры размером примерно 40х40
символов образующими узор.
 */
public class TextEditorByRostislav {
    public static void main(String[] args) {
        
    }
}
