package Tsymbaliuk_Oleksandr_JavaOOP.HW16;
/*
Функциональный интерфейс
UnaryOperator
Задание для самостоятельной проработки
1) С помощью реализации UnaryOperator замените все нечетные числа в списке целых
чисел на нули.
2) Создайте реализацию UnaryOperator<String> где результатом будет строка в которой
исключены все символы кроме цифровых. Т.е. если входящим параметром является
строка вида «Hello 123 world» результатом будет строка «123».
3) Создайте реализацию UnaryOperator<List<String>> где результатом будет список строк
(созданный на основе списка выступающего в качестве параметра) длинна которых
больше 5 символов.
 */
/*
Функциональный интерфейс
Consumer
Задание для самостоятельной проработки
1)Реализуйте Consumer<Integer> с помощью которого выведите на экран все нечетные
числа содержащиеся в List<Integer>.
2)Реализуете Consumer<String> с побочным эффектом в виде занесения всех строк
содержащих цифры во вспомогательный список.
3) Реализуйте BiConsumer<String, File> добавляющий строку в конец файла указанного в
качестве параметра.
 */
public class Main {
}
