package Tsimbaliuk.HW16;
/*
Функциональный интерфейс
BinaryOperator
Задание для самостоятельной проработки
1)Создайте реализацию BinaryOperator<String> которая будет возвращать самое
длинное слово из двух строк переданных в качестве параметров.
2)Создайте реализацию BinaryOperator<List<Integer>> которая вернет список в котором
будут только те элементы которые одновременно присутствуют в первом и во втором
списке целых чисел использованных в качестве параметров.
3) Создайте реализацию BinaryOperator<List<T extends Comparable<T>> который будет
возвращать список в котором находиться минимальный элемент среди двух списков
использованных в качестве параметра. Например для списков [5,0,3,4] и [10,-2, 5]
нужно вернуть [10, -2, 5] так как элемент -2 минимален среди элементов этих списков.
 */
public class Main {
}
